    clear
	close all
	clc%清理Matlab窗口
	A=imread('1.jpg');%读取图像x.jpg（引号内是图像在计算机内的存储路径）
	I=rgb2gray(A);%RGB图像转灰度图像
    figure(1);
    subplot(2,3,1);
    imshow(I),title('原始图像');
	I=im2double(I);
	T=dctmtx(8);%得到一个8*8的离散余弦变化矩阵
	B=blkproc(I,[8 8],'P1*x*P2',T,T'); 
	%x是每一个分成的8*8大小的块
	%P1*x*P2相当于像素块的处理函数
	%p1=T,p2=T’,fun=p1*x*p2'=T*x*T'是进行离散余弦变换
%%
    m=[1 0 0 0 0 0 0 0 
        0 0 0 0 0 0 0 0
        0 0 0 0 0 0 0 0
        0 0 0 0 0 0 0 0
        0 0 0 0 0 0 0 0
        0 0 0 0 0 0 0 0
        0 0 0 0 0 0 0 0
        0 0 0 0 0 0 0 0];%保留左上角1个系数
    B2=blkproc(B,[8 8],'P1.*x',m);%舍弃每个块中的高频系数，达到图像压缩的目的
    I2=blkproc(B2,[8 8],'P1*x*P2',T',T);%进行反余弦变换，得到压缩后的图象
    miss=abs(I-I2);
    subplot(2,3,2);
    imshow(I2),title('压缩（解压缩）图像（1个系数）');
%%
    m3=[1 1 1 0 0 0 0 0 
        1 1 0 0 0 0 0 0
        1 0 0 0 0 0 0 0
        0 0 0 0 0 0 0 0
        0 0 0 0 0 0 0 0
        0 0 0 0 0 0 0 0
        0 0 0 0 0 0 0 0
        0 0 0 0 0 0 0 0];%保留左上角6个系数
    B3=blkproc(B,[8 8],'P1.*x',m3);%舍弃每个块中的高频系数，达到图像压缩的目的
    I3=blkproc(B3,[8 8],'P1*x*P2',T',T);%进行反余弦变换，得到压缩后的图象
    miss3=abs(I-I3);
    subplot(2,3,3);
    imshow(I3),title('压缩（解压缩）图像（6个系数）');
%%
    m4=[1 1 1 1 1 0 0 0 
        1 1 1 1 0 0 0 0
        1 1 1 0 0 0 0 0
        1 1 0 0 0 0 0 0
        1 0 0 0 0 0 0 0
        0 0 0 0 0 0 0 0
        0 0 0 0 0 0 0 0
        0 0 0 0 0 0 0 0];%保留左上角15个系数
    B4=blkproc(B,[8 8],'P1.*x',m4);%舍弃每个块中的高频系数，达到图像压缩的目的
    I4=blkproc(B4,[8 8],'P1*x*P2',T',T);%进行反余弦变换，得到压缩后的图象
    miss4=abs(I-I4);
    subplot(2,3,4);
    imshow(I4),title('压缩（解压缩）图像（15个系数）');
%%
    m5=[1 1 1 1 1 1 1 0 
        1 1 1 1 1 1 0 0
        1 1 1 1 1 0 0 0
        1 1 1 1 0 0 0 0
        1 1 1 0 0 0 0 0
        1 1 0 0 0 0 0 0
        1 0 0 0 0 0 0 0
        0 0 0 0 0 0 0 0];%保留左上角28个系数
    B5=blkproc(B,[8 8],'P1.*x',m5);%舍弃每个块中的高频系数，达到图像压缩的目的
    I5=blkproc(B5,[8 8],'P1*x*P2',T',T);%进行反余弦变换，得到压缩后的图象
    miss5=abs(I-I5);
    subplot(2,3,5);
    imshow(I5),title('压缩（解压缩）图像（28个系数）');
